# Introduction to Pandas

In [37]:
#install pandas
!pip install pandas

Requirement already satisfied: pandas in c:\users\suvha\anaconda3\lib\site-packages (1.4.2)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\suvha\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\suvha\anaconda3\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: numpy>=1.18.5 in c:\users\suvha\anaconda3\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: six>=1.5 in c:\users\suvha\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [38]:
#import pandas
import pandas as pd

In [39]:
#create a list of data
data = [1,2,3,4,5,10]
data

[1, 2, 3, 4, 5, 10]

In [40]:
type(data)

list

In [41]:
#create a series from the list
s = pd.Series(data)
s

0     1
1     2
2     3
3     4
4     5
5    10
dtype: int64

In [42]:
type(s)

pandas.core.series.Series

In [47]:
#create a dataframe from the series
df = pd.DataFrame(s, columns = ['num1'])
df

   num1
0     1
1     2
2     3
3     4
4     5
5    10

In [48]:
type(df)

pandas.core.frame.DataFrame

In [49]:
#create a Dataframe from the list
df1 = pd.DataFrame(data, columns = ['num2'])
df1

   num2
0     1
1     2
2     3
3     4
4     5
5    10

In [50]:
type(df1)

pandas.core.frame.DataFrame

In [51]:
df

   num1
0     1
1     2
2     3
3     4
4     5
5    10

In [52]:
s1 = df['num1']

In [53]:
s1

0     1
1     2
2     3
3     4
4     5
5    10
Name: num1, dtype: int64

In [54]:
df1

   num2
0     1
1     2
2     3
3     4
4     5
5    10

In [55]:
s2 = df1['num2']

In [56]:
s2

0     1
1     2
2     3
3     4
4     5
5    10
Name: num2, dtype: int64

In [57]:
#create a series for integer columns
data1 = [[1,2],[3,4],[5,6]]
data1

[[1, 2], [3, 4], [5, 6]]

In [72]:
df3 = pd.DataFrame(data1)

In [61]:
df3

   0  1
0  1  2
1  3  4
2  5  6

In [74]:
data1

[[1, 2], [3, 4], [5, 6]]

In [79]:
df3 = pd.DataFrame(data1, columns = ['num1','num2'])
df3

   num1  num2
0     1     2
1     3     4
2     5     6

In [82]:
s3 = df3[['num1', 'num2']]
s3

   num1  num2
0     1     2
1     3     4
2     5     6

In [85]:
df4 = pd.DataFrame(s3, columns = ['num1', 'num2'])
df4

   num1  num2
0     1     2
1     3     4
2     5     6

# Dictionary to Series and Dataframe

In [86]:
import pandas as pd

In [88]:
#create a dictionary
data = {
    'name': ['sharmin', 'subha','mim'],
    'age': [23,24,20],
    'city': ['Dhaka', 'Cumilla', 'Narayangomj']
}

In [89]:
data

{'name': ['sharmin', 'subha', 'mim'],
 'age': [23, 24, 20],
 'city': ['Dhaka', 'Cumilla', 'Narayangomj']}

In [90]:
type(data)

dict

In [96]:
name_series = pd.Series(data['name'], name = 'Name')

In [97]:
name_series

0    sharmin
1      subha
2        mim
Name: Name, dtype: object

In [100]:
d_series = pd.Series(data, name = 'name')

In [101]:
d_series

name            [sharmin, subha, mim]
age                      [23, 24, 20]
city    [Dhaka, Cumilla, Narayangomj]
Name: name, dtype: object

In [102]:
df = pd.DataFrame(data)

In [103]:
df

      name  age         city
0  sharmin   23        Dhaka
1    subha   24      Cumilla
2      mim   20  Narayangomj

In [104]:
age_series = df['age']

In [105]:
age_series

0    23
1    24
2    20
Name: age, dtype: int64

# Set to Series and DataFrame

In [159]:
s1 = {1,2,3,4,5,6,7,20}
s1

{1, 2, 3, 4, 5, 6, 7, 20}

In [160]:
s = pd.Series(list(s1))
s

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7    20
dtype: int64

In [161]:
s1 =  pd.Series(tuple(s1))

In [118]:
s1

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7    20
dtype: int64

In [162]:
df = pd.DataFrame(s1, columns = ['set val'])
df

   set val
0        1
1        2
2        3
3        4
4        5
5        6
6        7
7       20

# Tuple to Series and DataFrame

In [163]:
t = (1,2,3,54,6)
t

(1, 2, 3, 54, 6)

In [164]:
s = pd.Series(t)

In [130]:
s

0     1
1     2
2     3
3    54
4     6
dtype: int64

In [165]:
df = pd.DataFrame(t)

In [166]:
df

    0
0   1
1   2
2   3
3  54
4   6

In [167]:
t = (1,2,3,54,6,True,False)
t

(1, 2, 3, 54, 6, True, False)

In [169]:
s = pd.Series(t)
s

0        1
1        2
2        3
3       54
4        6
5     True
6    False
dtype: object

In [170]:
df = pd.DataFrame(t, columns = ['tuple value'])

In [171]:
df

  tuple value
0           1
1           2
2           3
3          54
4           6
5        True
6       False

In [172]:
type(df)

pandas.core.frame.DataFrame

In [142]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 1 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   tuple value  7 non-null      object
dtypes: object(1)
memory usage: 184.0+ bytes

# Numeric DataType in Pandas

In [9]:
import  pandas as pd

In [12]:
#creating a DataFrame with integer data
data = {'age': [25,30,26,28,20,22,40,28],
        'salary': [50000,65000,45000,67000,32000,40000,8000,5000]}

data

{'age': [25, 30, 26, 28, 20, 22, 40, 28],
 'salary': [50000, 65000, 45000, 67000, 32000, 40000, 8000, 5000]}

In [13]:
type(data)

dict

In [14]:
df = pd.DataFrame(data)
df

   age  salary
0   25   50000
1   30   65000
2   26   45000
3   28   67000
4   20   32000
5   22   40000
6   40    8000
7   28    5000

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     8 non-null      int64
 1   salary  8 non-null      int64
dtypes: int64(2)
memory usage: 256.0 bytes

In [16]:
df.dtypes

age       int64
salary    int64
dtype: object

In [17]:
#creating data type to int32
df['age'] = df['age'].astype('int32')
df['salary'] = df['salary'].astype('int32')
df

   age  salary
0   25   50000
1   30   65000
2   26   45000
3   28   67000
4   20   32000
5   22   40000
6   40    8000
7   28    5000

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     8 non-null      int32
 1   salary  8 non-null      int32
dtypes: int32(2)
memory usage: 192.0 bytes

In [19]:
2**32

4294967296

In [20]:
4294967296/2

2147483648.0

In [ ]:
-2147483648.0 to 2147483648.0

In [21]:
#creating data type to int32
df['age'] = df['age'].astype('int16')
df['salary'] = df['salary'].astype('int16')
df

   age  salary
0   25  -15536
1   30    -536
2   26  -20536
3   28    1464
4   20   32000
5   22  -25536
6   40    8000
7   28    5000

In [22]:
2**15

32768

In [23]:
32768/2

16384.0

In [ ]:
-16384.0 to 16384.0

In [28]:
#creating a DataFrame with integer data
data = {'age': [25,30,26,28,20,22,40,28],
        'salary': [50000,65000,45000,67000,32000,40000,8000,5000]}
data

{'age': [25, 30, 26, 28, 20, 22, 40, 28],
 'salary': [50000, 65000, 45000, 67000, 32000, 40000, 8000, 5000]}

In [30]:
df = pd.DataFrame(data)
df

   age  salary
0   25   50000
1   30   65000
2   26   45000
3   28   67000
4   20   32000
5   22   40000
6   40    8000
7   28    5000

In [31]:
#creating data type to float64
df['age'] = df['age'].astype('float64')
df['salary'] = df['salary'].astype('float64')
df

    age   salary
0  25.0  50000.0
1  30.0  65000.0
2  26.0  45000.0
3  28.0  67000.0
4  20.0  32000.0
5  22.0  40000.0
6  40.0   8000.0
7  28.0   5000.0

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     8 non-null      float64
 1   salary  8 non-null      float64
dtypes: float64(2)
memory usage: 256.0 bytes

# object, datetime datatype

In [33]:
import pandas as pd

In [38]:
#creating a dictionary with mixed data types
data = {
    'Name': ['sharmin','subha','mim'],
    'age': [23,24,25],
    'occupation': ['data science', 'software engineering','teacher'],
    'salary' : [600000,550000,70000]
}

In [39]:
data

{'Name': ['sharmin', 'subha', 'mim'],
 'age': [23, 24, 25],
 'occupation': ['data science', 'software engineering', 'teacher'],
 'salary': [600000, 550000, 70000]}

In [40]:
#create a dataframe and check the data types
df = pd.DataFrame(data)
print(df.dtypes)

Name          object
age            int64
occupation    object
salary         int64
dtype: object

In [41]:
df

      Name  age            occupation  salary
0  sharmin   23          data science  600000
1    subha   24  software engineering  550000
2      mim   25               teacher   70000

In [42]:
#creating a dictionary with mixed data types
data = {
    'Name': ['sharmin','subha','mim'],
    'age': [23,24,25],
    'occupation': ['data science', 'software engineering','teacher'],
    'salary' : ['600000 euro','550000 euro','70000 euro']
}

In [43]:
data

{'Name': ['sharmin', 'subha', 'mim'],
 'age': [23, 24, 25],
 'occupation': ['data science', 'software engineering', 'teacher'],
 'salary': ['600000 euro', '550000 euro', '70000 euro']}

In [45]:
df = pd.DataFrame(data)
print(df.dtypes)

Name          object
age            int64
occupation    object
salary        object
dtype: object

In [46]:
df

      Name  age            occupation       salary
0  sharmin   23          data science  600000 euro
1    subha   24  software engineering  550000 euro
2      mim   25               teacher   70000 euro

# Datetime

In [45]:
import pandas as pd

In [46]:
#create a list of dates
dates = ['2023-10-01', '2024-11-15','2525-01-01']

#create a dataframe with a datetime column
df1 = pd.DataFrame({'Date': dates})

#check the data type of the 'date column'
df1['Date'].dtype

dtype('O')

In [47]:
df1

         Date
0  2023-10-01
1  2024-11-15
2  2525-01-01

In [49]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    3 non-null      object
dtypes: object(1)
memory usage: 152.0+ bytes

In [56]:
#create a list of dates
dates = ['2023', '2024-06-07','2525']

#create a dataframe with a datetime column
df1 = pd.DataFrame({'Date': dates})

timestamps = pd.to_dateti-me(dates)
df2 = pd.DataFrame({'Date2': timestamps})

#check the data type of the 'date column'
df1['Date'].dtype

AttributeError: module 'pandas' has no attribute 'to_dateti'

In [33]:
df2['Data2'].dtype

KeyError: 'Data2'

In [60]:
dates = ['2023-10-01 12:34:56.123456789', '2024-11-15 11:45:45.4556677888']
timestamps = pd.to_datetime(dates)
df2 = pd.DataFrame({'Date2': timestamps})

In [61]:
df2

                          Date2
0 2023-10-01 12:34:56.123456789
1 2024-11-15 11:45:45.455667788

In [62]:
df2['Date2'].dtype

dtype('<M8[ns]')

In [63]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date2   2 non-null      datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 144.0 bytes

In [65]:
dates = ['2023-10-01 12:34:56.123456789', '2024-11-15 11:45:45.4556677888']
timestamps = pd.to_datetime(dates)
df3 = pd.Series({'Date3': timestamps})

In [66]:
df3

Date3    DatetimeIndex(['2023-10-01 12:34:56.123456789'...
dtype: object

In [68]:
df3.dtype

dtype('O')

In [70]:
df3.info()

<class 'pandas.core.series.Series'>
Index: 1 entries, Date3 to Date3
Series name: None
Non-Null Count  Dtype
--------------  -----
1 non-null      object
dtypes: object(1)
memory usage: 124.0+ bytes